UTAF_Base/requestFiles/BPS_BillingAccount_UpdateBillingAccount_address.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v1.billingaccount.bps.services.bgc"
	xmlns:urn2="urn:v1.requestupdatebillingaccount.bps.objects.bgc">
	<soapenv:Header>
		<urn:Context version="4.0">
			<urn:correlationId>${Req_corrId}</urn:correlationId>
			<urn:consumerApplicationId>TST</urn:consumerApplicationId>
			<urn:endUserId>id000000</urn:endUserId>
			<urn:endUserLanguage>EN</urn:endUserLanguage>
		</urn:Context>
	</soapenv:Header>
	<soapenv:Body>
		<urn1:RequestDataUpdateBillingAccount
			version="1.1">
			<urn1:billingAccount>
				<urn2:identifier>
					<urn2:id>${Req_billingAccountId}</urn2:id>
					<urn2:idContext>
						<urn2:value>CDB</urn2:value>
					</urn2:idContext>
				</urn2:identifier>
				<urn2:billRecipient>
					<urn2:contactMedium>
						<urn2:postalContact updateAction="modify">
							<urn2:address>
								<urn2:urbanSubAddress>
									<urn2:houseNumberFirst>${Req_houseNumberFirst}</urn2:houseNumberFirst>
									<urn2:blockNumber>${Req_blockNumber}</urn2:blockNumber>
									<urn2:floorNumber>${Req_floorNumber}</urn2:floorNumber>
									<urn2:apartmentNumber>${Req_apartmentNumber}</urn2:apartmentNumber>
									<urn2:boxNumber>${Req_boxNumber}</urn2:boxNumber>
									<urn2:identifier>
										<urn2:id>1</urn2:id>
									</urn2:identifier>
									<urn2:validFor>
										<urn2:startTimeStamp>${Req_startTimeStamp}</urn2:startTimeStamp>
									</urn2:validFor>
									<urn2:street>
										<urn2:identifier>
											<urn2:id>${Req_street_id}</urn2:id>
											<urn2:idContext>
												<urn2:value>AGS</urn2:value>
											</urn2:idContext>
										</urn2:identifier>
									</urn2:street>
									<urn2:city>
										<urn2:identifier>
											<urn2:id>${Req_city_id}</urn2:id>
											<urn2:idContext>
												<urn2:value>AGS</urn2:value>
											</urn2:idContext>
										</urn2:identifier>
									</urn2:city>
									<urn2:country>
										<urn2:codeISO3>
											<urn2:alpha3Code>${Req_alpha3Code}</urn2:alpha3Code>
										</urn2:codeISO3>
									</urn2:country>
								</urn2:urbanSubAddress>
							</urn2:address>
						</urn2:postalContact>
					</urn2:contactMedium>
				</urn2:billRecipient>
			</urn1:billingAccount>
			<urn1:transactionData>
				<urn1:userContext>
					<urn1:applicationName>TST</urn1:applicationName>
					<urn1:correlationId>${Req_corrId}</urn1:correlationId>
					<urn1:userId>id000000</urn1:userId>
					<urn1:languageISO2Code>EN</urn1:languageISO2Code>
				</urn1:userContext>
			</urn1:transactionData>
		</urn1:RequestDataUpdateBillingAccount>
	</soapenv:Body>
</soapenv:Envelope>